cask_args appdir: '/Applications'

brew 'coreutils'
brew 'diff-so-fancy'
brew 'git'
brew 'hub'
brew 'lastpass-cli'
brew 'maven'
brew 'node'
brew 'python'
brew 'python3'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zsh'

cask '1password'
cask 'alfred'
cask 'dash'
cask 'docker'
cask 'google-chrome'
cask 'iterm2'
cask 'java' unless system '/usr/libexec/java_home --failfast > /dev/null'
cask 'mplayerx'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'transmission'
cask 'visual-studio-code'

tap 'caskroom/fonts'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-g-for-powerline'
