tap "bufbuild/buf"
tap "garethr/kubeval"
tap "grpc/grpc"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "yoheimuta/protolint"

cask "osxfuse"
cask "alacritty"
cask "alfred"
cask "caffeine"
cask "colorpicker-skalacolor"
cask "corretto"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-g-for-powerline"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite-no-mail"
cask "java"
cask "mactex-no-gui"
cask "mplayerx"
cask "spectacle"
cask "transmission"
cask "virtualbox"
cask "visual-studio-code"
cask "xquartz"

brew "black"
brew "clang-format"
brew "cmake"
brew "cookiecutter"
brew "coreutils"
brew "diff-so-fancy"
brew "fd"
brew "fzf"
brew "gcsfuse"
brew "gettext", link: true
brew "ghostscript"
brew "git"
brew "go"
brew "glide"
brew "gnu-sed"
brew "gnupg", link: false
brew "google-java-format"
brew "gradle"
brew "graphviz"
brew "groovy"
brew "grpc"
brew "grpcurl"
brew "protobuf"
brew "helm"
brew "python", link: false
brew "imagemagick"
brew "istioctl"
brew "jenv"
brew "jo"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "lastpass-cli"
brew "lftp"
brew "make"
brew "maven"
brew "minikube"
brew "mysql-client"
brew "node"
brew "openssh"
brew "pandoc"
brew "pinentry-mac"
brew "plantuml"
brew "prototool"
brew "pyenv-virtualenv"
brew "rename"
brew "sbt"
brew "scala"
brew "shellcheck"
brew "starship"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "with-readline"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zplug"
brew "zsh"
brew "bufbuild/buf/buf", link: false
brew "garethr/kubeval/kubeval"
brew "yoheimuta/protolint/protolint"
